---
kind: other
id: Methods.T:Autodesk.Revit.DB.HasNoValueFilterRule
source: html/2905e0c3-9c3d-4f33-4926-fa4ec31615f8.htm
---
# HasNoValueFilterRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.